perftest/gin_pgx/gin_pgx_getid.txt
[ GET /node/1 200][1]

Summary:
  Total:	60.0275 secs
  Slowest:	0.3339 secs
  Fastest:	0.0010 secs
  Average:	0.0364 secs
  Requests/sec:	1372.1218
  
  Total data:	68610045 bytes
  Size/request:	833 bytes

Response time histogram:
  0.001 [1]	|
  0.034 [50108]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.068 [21512]	|■■■■■■■■■■■■■■■■■
  0.101 [7239]	|■■■■■■
  0.134 [2364]	|■■
  0.167 [765]	|■
  0.201 [258]	|
  0.234 [71]	|
  0.267 [31]	|
  0.301 [13]	|
  0.334 [3]	|


Latency distribution:
  10% in 0.0110 secs
  25% in 0.0152 secs
  50% in 0.0268 secs
  75% in 0.0481 secs
  90% in 0.0754 secs
  95% in 0.0959 secs
  99% in 0.1448 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0010 secs, 0.3339 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0065 secs
  resp wait:	0.0363 secs, 0.0009 secs, 0.3339 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0052 secs

Status code distribution:
  [200]	82365 responses



[ GET /node/1 200][2]

Summary:
  Total:	60.0297 secs
  Slowest:	0.3084 secs
  Fastest:	0.0012 secs
  Average:	0.0356 secs
  Requests/sec:	1403.9210
  
  Total data:	70202741 bytes
  Size/request:	833 bytes

Response time histogram:
  0.001 [1]	|
  0.032 [49581]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.063 [22275]	|■■■■■■■■■■■■■■■■■■
  0.093 [8167]	|■■■■■■■
  0.124 [2831]	|■■
  0.155 [932]	|■
  0.186 [314]	|
  0.216 [116]	|
  0.247 [41]	|
  0.278 [14]	|
  0.308 [5]	|


Latency distribution:
  10% in 0.0108 secs
  25% in 0.0149 secs
  50% in 0.0263 secs
  75% in 0.0471 secs
  90% in 0.0738 secs
  95% in 0.0936 secs
  99% in 0.1387 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0012 secs, 0.3084 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0058 secs
  resp wait:	0.0355 secs, 0.0011 secs, 0.3084 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0083 secs

Status code distribution:
  [200]	84277 responses



[ GET /node/1 200][3]

Summary:
  Total:	60.0311 secs
  Slowest:	0.3409 secs
  Fastest:	0.0014 secs
  Average:	0.0355 secs
  Requests/sec:	1407.4360
  
  Total data:	70380170 bytes
  Size/request:	833 bytes

Response time histogram:
  0.001 [1]	|
  0.035 [53355]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.069 [21357]	|■■■■■■■■■■■■■■■■
  0.103 [6688]	|■■■■■
  0.137 [2102]	|■■
  0.171 [696]	|■
  0.205 [212]	|
  0.239 [56]	|
  0.273 [15]	|
  0.307 [4]	|
  0.341 [4]	|


Latency distribution:
  10% in 0.0108 secs
  25% in 0.0148 secs
  50% in 0.0260 secs
  75% in 0.0468 secs
  90% in 0.0735 secs
  95% in 0.0938 secs
  99% in 0.1419 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0014 secs, 0.3409 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0057 secs
  resp wait:	0.0354 secs, 0.0013 secs, 0.3408 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0051 secs

Status code distribution:
  [200]	84490 responses



[ GET /node/1 200][4]

Summary:
  Total:	60.0392 secs
  Slowest:	0.4263 secs
  Fastest:	0.0018 secs
  Average:	0.0359 secs
  Requests/sec:	1392.3730
  
  Total data:	69636301 bytes
  Size/request:	833 bytes

Response time histogram:
  0.002 [1]	|
  0.044 [60463]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.087 [17679]	|■■■■■■■■■■■■
  0.129 [4186]	|■■■
  0.172 [956]	|■
  0.214 [231]	|
  0.257 [61]	|
  0.299 [12]	|
  0.341 [5]	|
  0.384 [2]	|
  0.426 [1]	|


Latency distribution:
  10% in 0.0109 secs
  25% in 0.0150 secs
  50% in 0.0265 secs
  75% in 0.0475 secs
  90% in 0.0740 secs
  95% in 0.0945 secs
  99% in 0.1414 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0018 secs, 0.4263 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0094 secs
  resp wait:	0.0358 secs, 0.0017 secs, 0.4263 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0054 secs

Status code distribution:
  [200]	83597 responses



[ GET /node/1 200][5]

Summary:
  Total:	60.0336 secs
  Slowest:	0.4042 secs
  Fastest:	0.0018 secs
  Average:	0.0392 secs
  Requests/sec:	1275.6697
  
  Total data:	63793639 bytes
  Size/request:	833 bytes

Response time histogram:
  0.002 [1]	|
  0.042 [50947]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.082 [18220]	|■■■■■■■■■■■■■■
  0.123 [5293]	|■■■■
  0.163 [1525]	|■
  0.203 [427]	|
  0.243 [111]	|
  0.283 [46]	|
  0.324 [7]	|
  0.364 [5]	|
  0.404 [1]	|


Latency distribution:
  10% in 0.0117 secs
  25% in 0.0162 secs
  50% in 0.0289 secs
  75% in 0.0517 secs
  90% in 0.0813 secs
  95% in 0.1033 secs
  99% in 0.1555 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0018 secs, 0.4042 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0041 secs
  resp wait:	0.0391 secs, 0.0017 secs, 0.4042 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0062 secs

Status code distribution:
  [200]	76583 responses



[ GET /node/1 400][1]

Summary:
  Total:	60.0358 secs
  Slowest:	0.3216 secs
  Fastest:	0.0017 secs
  Average:	0.0366 secs
  Requests/sec:	1365.9013
  
  Total data:	68308499 bytes
  Size/request:	833 bytes

Response time histogram:
  0.002 [1]	|
  0.034 [49271]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.066 [21126]	|■■■■■■■■■■■■■■■■■
  0.098 [7621]	|■■■■■■
  0.130 [2603]	|■■
  0.162 [880]	|■
  0.194 [326]	|
  0.226 [111]	|
  0.258 [43]	|
  0.290 [13]	|
  0.322 [8]	|


Latency distribution:
  10% in 0.0110 secs
  25% in 0.0152 secs
  50% in 0.0270 secs
  75% in 0.0481 secs
  90% in 0.0760 secs
  95% in 0.0968 secs
  99% in 0.1451 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0017 secs, 0.3216 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0051 secs
  resp wait:	0.0365 secs, 0.0016 secs, 0.3216 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0053 secs

Status code distribution:
  [200]	82003 responses



[ GET /node/1 400][2]

Summary:
  Total:	60.0331 secs
  Slowest:	0.4929 secs
  Fastest:	0.0018 secs
  Average:	0.0372 secs
  Requests/sec:	1342.0263
  
  Total data:	67111478 bytes
  Size/request:	833 bytes

Response time histogram:
  0.002 [1]	|
  0.051 [61689]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.100 [14960]	|■■■■■■■■■■
  0.149 [3154]	|■■
  0.198 [609]	|
  0.247 [118]	|
  0.296 [28]	|
  0.346 [4]	|
  0.395 [1]	|
  0.444 [1]	|
  0.493 [1]	|


Latency distribution:
  10% in 0.0112 secs
  25% in 0.0155 secs
  50% in 0.0275 secs
  75% in 0.0490 secs
  90% in 0.0773 secs
  95% in 0.0990 secs
  99% in 0.1471 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0018 secs, 0.4929 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0048 secs
  resp wait:	0.0372 secs, 0.0017 secs, 0.4928 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0059 secs

Status code distribution:
  [200]	80566 responses



[ GET /node/1 400][3]

Summary:
  Total:	60.0359 secs
  Slowest:	0.4314 secs
  Fastest:	0.0017 secs
  Average:	0.0358 secs
  Requests/sec:	1395.9324
  
  Total data:	69810398 bytes
  Size/request:	833 bytes

Response time histogram:
  0.002 [1]	|
  0.045 [61047]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.088 [17503]	|■■■■■■■■■■■
  0.131 [4027]	|■■■
  0.174 [927]	|■
  0.217 [239]	|
  0.260 [49]	|
  0.302 [9]	|
  0.345 [2]	|
  0.388 [1]	|
  0.431 [1]	|


Latency distribution:
  10% in 0.0109 secs
  25% in 0.0151 secs
  50% in 0.0264 secs
  75% in 0.0472 secs
  90% in 0.0739 secs
  95% in 0.0947 secs
  99% in 0.1427 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0017 secs, 0.4314 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0062 secs
  resp wait:	0.0357 secs, 0.0016 secs, 0.4313 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0064 secs

Status code distribution:
  [200]	83806 responses



[ GET /node/1 400][4]

Summary:
  Total:	60.0380 secs
  Slowest:	0.3383 secs
  Fastest:	0.0015 secs
  Average:	0.0358 secs
  Requests/sec:	1396.8989
  
  Total data:	69861211 bytes
  Size/request:	833 bytes

Response time histogram:
  0.002 [1]	|
  0.035 [52482]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.069 [21386]	|■■■■■■■■■■■■■■■■
  0.103 [6869]	|■■■■■
  0.136 [2191]	|■■
  0.170 [637]	|
  0.204 [195]	|
  0.237 [71]	|
  0.271 [28]	|
  0.305 [3]	|
  0.338 [4]	|


Latency distribution:
  10% in 0.0109 secs
  25% in 0.0150 secs
  50% in 0.0264 secs
  75% in 0.0473 secs
  90% in 0.0740 secs
  95% in 0.0937 secs
  99% in 0.1395 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0015 secs, 0.3383 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0039 secs
  resp wait:	0.0357 secs, 0.0014 secs, 0.3382 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0064 secs

Status code distribution:
  [200]	83867 responses



[ GET /node/1 400][5]

Summary:
  Total:	60.0348 secs
  Slowest:	0.3213 secs
  Fastest:	0.0017 secs
  Average:	0.0357 secs
  Requests/sec:	1398.0713
  
  Total data:	69916189 bytes
  Size/request:	833 bytes

Response time histogram:
  0.002 [1]	|
  0.034 [51087]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.066 [21572]	|■■■■■■■■■■■■■■■■■
  0.098 [7456]	|■■■■■■
  0.130 [2528]	|■■
  0.162 [850]	|■
  0.193 [277]	|
  0.225 [105]	|
  0.257 [39]	|
  0.289 [14]	|
  0.321 [4]	|


Latency distribution:
  10% in 0.0108 secs
  25% in 0.0148 secs
  50% in 0.0261 secs
  75% in 0.0471 secs
  90% in 0.0744 secs
  95% in 0.0948 secs
  99% in 0.1424 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0017 secs, 0.3213 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0036 secs
  resp wait:	0.0357 secs, 0.0016 secs, 0.3213 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0053 secs

Status code distribution:
  [200]	83933 responses



[ GET /node/1 600][1]

Summary:
  Total:	60.0322 secs
  Slowest:	0.3314 secs
  Fastest:	0.0017 secs
  Average:	0.0365 secs
  Requests/sec:	1370.2307
  
  Total data:	68520914 bytes
  Size/request:	833 bytes

Response time histogram:
  0.002 [1]	|
  0.035 [50325]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.068 [21219]	|■■■■■■■■■■■■■■■■■
  0.101 [7171]	|■■■■■■
  0.134 [2336]	|■■
  0.167 [785]	|■
  0.200 [251]	|
  0.232 [109]	|
  0.265 [42]	|
  0.298 [16]	|
  0.331 [3]	|


Latency distribution:
  10% in 0.0111 secs
  25% in 0.0151 secs
  50% in 0.0268 secs
  75% in 0.0480 secs
  90% in 0.0752 secs
  95% in 0.0961 secs
  99% in 0.1454 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0017 secs, 0.3314 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0043 secs
  resp wait:	0.0364 secs, 0.0016 secs, 0.3313 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0068 secs

Status code distribution:
  [200]	82258 responses



[ GET /node/1 600][2]

Summary:
  Total:	60.0332 secs
  Slowest:	0.3321 secs
  Fastest:	0.0016 secs
  Average:	0.0361 secs
  Requests/sec:	1385.3834
  
  Total data:	69279777 bytes
  Size/request:	833 bytes

Response time histogram:
  0.002 [1]	|
  0.035 [51110]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.068 [21599]	|■■■■■■■■■■■■■■■■■
  0.101 [7012]	|■■■■■
  0.134 [2362]	|■■
  0.167 [719]	|■
  0.200 [257]	|
  0.233 [76]	|
  0.266 [22]	|
  0.299 [9]	|
  0.332 [2]	|


Latency distribution:
  10% in 0.0110 secs
  25% in 0.0152 secs
  50% in 0.0266 secs
  75% in 0.0476 secs
  90% in 0.0746 secs
  95% in 0.0953 secs
  99% in 0.1425 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0016 secs, 0.3321 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0047 secs
  resp wait:	0.0360 secs, 0.0016 secs, 0.3320 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0065 secs

Status code distribution:
  [200]	83169 responses



[ GET /node/1 600][3]

Summary:
  Total:	60.0298 secs
  Slowest:	0.3775 secs
  Fastest:	0.0014 secs
  Average:	0.0359 secs
  Requests/sec:	1393.0588
  
  Total data:	69659625 bytes
  Size/request:	833 bytes

Response time histogram:
  0.001 [1]	|
  0.039 [56029]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.077 [19960]	|■■■■■■■■■■■■■■
  0.114 [5468]	|■■■■
  0.152 [1552]	|■
  0.189 [429]	|
  0.227 [128]	|
  0.265 [46]	|
  0.302 [9]	|
  0.340 [0]	|
  0.378 [3]	|


Latency distribution:
  10% in 0.0109 secs
  25% in 0.0150 secs
  50% in 0.0264 secs
  75% in 0.0474 secs
  90% in 0.0740 secs
  95% in 0.0948 secs
  99% in 0.1422 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0014 secs, 0.3775 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0046 secs
  resp wait:	0.0358 secs, 0.0013 secs, 0.3774 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0058 secs

Status code distribution:
  [200]	83625 responses



[ GET /node/1 600][4]

Summary:
  Total:	60.0311 secs
  Slowest:	0.4773 secs
  Fastest:	0.0016 secs
  Average:	0.0364 secs
  Requests/sec:	1374.3207
  
  Total data:	68724166 bytes
  Size/request:	833 bytes

Response time histogram:
  0.002 [1]	|
  0.049 [62732]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.097 [15793]	|■■■■■■■■■■
  0.144 [3211]	|■■
  0.192 [593]	|
  0.239 [133]	|
  0.287 [32]	|
  0.335 [6]	|
  0.382 [0]	|
  0.430 [0]	|
  0.477 [1]	|


Latency distribution:
  10% in 0.0111 secs
  25% in 0.0153 secs
  50% in 0.0269 secs
  75% in 0.0480 secs
  90% in 0.0750 secs
  95% in 0.0956 secs
  99% in 0.1426 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0016 secs, 0.4773 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0088 secs
  resp wait:	0.0363 secs, 0.0015 secs, 0.4773 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0061 secs

Status code distribution:
  [200]	82502 responses



[ GET /node/1 600][5]

Summary:
  Total:	60.0309 secs
  Slowest:	0.3665 secs
  Fastest:	0.0012 secs
  Average:	0.0362 secs
  Requests/sec:	1381.5060
  
  Total data:	69083189 bytes
  Size/request:	833 bytes

Response time histogram:
  0.001 [1]	|
  0.038 [54143]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.074 [20413]	|■■■■■■■■■■■■■■■
  0.111 [5983]	|■■■■
  0.147 [1706]	|■
  0.184 [497]	|
  0.220 [137]	|
  0.257 [38]	|
  0.293 [13]	|
  0.330 [1]	|
  0.366 [1]	|


Latency distribution:
  10% in 0.0111 secs
  25% in 0.0154 secs
  50% in 0.0268 secs
  75% in 0.0477 secs
  90% in 0.0746 secs
  95% in 0.0948 secs
  99% in 0.1421 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0012 secs, 0.3665 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0038 secs
  resp wait:	0.0361 secs, 0.0012 secs, 0.3664 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0063 secs

Status code distribution:
  [200]	82933 responses



[ GET /node/1 800][1]

Summary:
  Total:	60.0271 secs
  Slowest:	0.3402 secs
  Fastest:	0.0017 secs
  Average:	0.0354 secs
  Requests/sec:	1409.9466
  
  Total data:	70500955 bytes
  Size/request:	833 bytes

Response time histogram:
  0.002 [1]	|
  0.036 [53765]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.069 [21159]	|■■■■■■■■■■■■■■■■
  0.103 [6752]	|■■■■■
  0.137 [2029]	|■■
  0.171 [655]	|
  0.205 [193]	|
  0.239 [55]	|
  0.273 [18]	|
  0.306 [4]	|
  0.340 [4]	|


Latency distribution:
  10% in 0.0108 secs
  25% in 0.0149 secs
  50% in 0.0263 secs
  75% in 0.0467 secs
  90% in 0.0734 secs
  95% in 0.0930 secs
  99% in 0.1397 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0017 secs, 0.3402 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0045 secs
  resp wait:	0.0354 secs, 0.0016 secs, 0.3401 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0054 secs

Status code distribution:
  [200]	84635 responses



[ GET /node/1 800][2]

Summary:
  Total:	60.0311 secs
  Slowest:	0.3728 secs
  Fastest:	0.0010 secs
  Average:	0.0357 secs
  Requests/sec:	1399.0419
  
  Total data:	69960338 bytes
  Size/request:	833 bytes

Response time histogram:
  0.001 [1]	|
  0.038 [55801]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.075 [20231]	|■■■■■■■■■■■■■■■
  0.113 [5791]	|■■■■
  0.150 [1586]	|■
  0.187 [413]	|
  0.224 [118]	|
  0.261 [32]	|
  0.298 [7]	|
  0.336 [4]	|
  0.373 [2]	|


Latency distribution:
  10% in 0.0110 secs
  25% in 0.0152 secs
  50% in 0.0265 secs
  75% in 0.0472 secs
  90% in 0.0737 secs
  95% in 0.0932 secs
  99% in 0.1402 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0010 secs, 0.3728 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0047 secs
  resp wait:	0.0356 secs, 0.0009 secs, 0.3727 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0050 secs

Status code distribution:
  [200]	83986 responses



[ GET /node/1 800][3]

Summary:
  Total:	60.0351 secs
  Slowest:	0.3492 secs
  Fastest:	0.0015 secs
  Average:	0.0356 secs
  Requests/sec:	1402.5140
  
  Total data:	70138600 bytes
  Size/request:	833 bytes

Response time histogram:
  0.002 [1]	|
  0.036 [53896]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.071 [21127]	|■■■■■■■■■■■■■■■■
  0.106 [6496]	|■■■■■
  0.141 [1910]	|■
  0.175 [539]	|
  0.210 [152]	|
  0.245 [59]	|
  0.280 [16]	|
  0.314 [3]	|
  0.349 [1]	|


Latency distribution:
  10% in 0.0109 secs
  25% in 0.0150 secs
  50% in 0.0266 secs
  75% in 0.0472 secs
  90% in 0.0735 secs
  95% in 0.0930 secs
  99% in 0.1381 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0015 secs, 0.3492 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0050 secs
  resp wait:	0.0356 secs, 0.0015 secs, 0.3492 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0054 secs

Status code distribution:
  [200]	84200 responses



[ GET /node/1 800][4]

Summary:
  Total:	60.0297 secs
  Slowest:	0.3066 secs
  Fastest:	0.0017 secs
  Average:	0.0327 secs
  Requests/sec:	1526.8270
  
  Total data:	76348615 bytes
  Size/request:	833 bytes

Response time histogram:
  0.002 [1]	|
  0.032 [57591]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.063 [23043]	|■■■■■■■■■■■■■■■■
  0.093 [7439]	|■■■■■
  0.124 [2374]	|■■
  0.154 [813]	|■
  0.185 [277]	|
  0.215 [83]	|
  0.246 [24]	|
  0.276 [5]	|
  0.307 [5]	|


Latency distribution:
  10% in 0.0100 secs
  25% in 0.0136 secs
  50% in 0.0241 secs
  75% in 0.0431 secs
  90% in 0.0678 secs
  95% in 0.0867 secs
  99% in 0.1312 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0017 secs, 0.3066 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0046 secs
  resp wait:	0.0327 secs, 0.0016 secs, 0.3064 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0046 secs

Status code distribution:
  [200]	91655 responses



[ GET /node/1 800][5]

Summary:
  Total:	60.0300 secs
  Slowest:	0.3446 secs
  Fastest:	0.0015 secs
  Average:	0.0332 secs
  Requests/sec:	1506.1480
  
  Total data:	75314862 bytes
  Size/request:	833 bytes

Response time histogram:
  0.002 [1]	|
  0.036 [60652]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.070 [21147]	|■■■■■■■■■■■■■■
  0.104 [6073]	|■■■■
  0.139 [1840]	|■
  0.173 [503]	|
  0.207 [139]	|
  0.242 [43]	|
  0.276 [12]	|
  0.310 [2]	|
  0.345 [2]	|


Latency distribution:
  10% in 0.0100 secs
  25% in 0.0137 secs
  50% in 0.0245 secs
  75% in 0.0435 secs
  90% in 0.0689 secs
  95% in 0.0882 secs
  99% in 0.1326 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0015 secs, 0.3446 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0048 secs
  resp wait:	0.0331 secs, 0.0015 secs, 0.3445 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0055 secs

Status code distribution:
  [200]	90414 responses



[ GET /node/1 1000][1]

Summary:
  Total:  60.0329 secs
  Slowest:  0.3730 secs
  Fastest:  0.0016 secs
  Average:  0.0370 secs
  Requests/sec: 1349.8257
  
  Total data: 67501322 bytes
  Size/request: 833 bytes

Response time histogram:
  0.002 [1] |
  0.039 [53235] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.076 [19451] |■■■■■■■■■■■■■■■
  0.113 [5937]  |■■■■
  0.150 [1706]  |■
  0.187 [488] |
  0.224 [155] |
  0.262 [43]  |
  0.299 [12]  |
  0.336 [4] |
  0.373 [2] |


Latency distribution:
  10% in 0.0113 secs
  25% in 0.0153 secs
  50% in 0.0274 secs
  75% in 0.0487 secs
  90% in 0.0768 secs
  95% in 0.0976 secs
  99% in 0.1463 secs

Details (average, fastest, slowest):
  DNS+dialup: 0.0000 secs, 0.0016 secs, 0.3730 secs
  DNS-lookup: 0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:  0.0000 secs, 0.0000 secs, 0.0050 secs
  resp wait:  0.0369 secs, 0.0016 secs, 0.3729 secs
  resp read:  0.0000 secs, 0.0000 secs, 0.0054 secs

Status code distribution:
  [200] 81034 responses



[ GET /node/1 1000][2]

Summary:
  Total:  60.0305 secs
  Slowest:  0.4218 secs
  Fastest:  0.0015 secs
  Average:  0.0369 secs
  Requests/sec: 1355.1122
  
  Total data: 67762884 bytes
  Size/request: 833 bytes

Response time histogram:
  0.002 [1] |
  0.044 [57423] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.086 [17894] |■■■■■■■■■■■■
  0.128 [4510]  |■■■
  0.170 [1116]  |■
  0.212 [306] |
  0.254 [84]  |
  0.296 [11]  |
  0.338 [2] |
  0.380 [0] |
  0.422 [1] |


Latency distribution:
  10% in 0.0113 secs
  25% in 0.0154 secs
  50% in 0.0270 secs
  75% in 0.0486 secs
  90% in 0.0763 secs
  95% in 0.0974 secs
  99% in 0.1472 secs

Details (average, fastest, slowest):
  DNS+dialup: 0.0000 secs, 0.0015 secs, 0.4218 secs
  DNS-lookup: 0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:  0.0000 secs, 0.0000 secs, 0.0044 secs
  resp wait:  0.0368 secs, 0.0015 secs, 0.4218 secs
  resp read:  0.0000 secs, 0.0000 secs, 0.0067 secs

Status code distribution:
  [200] 81348 responses



[ GET /node/1 1000][3]

Summary:
  Total:  60.0315 secs
  Slowest:  0.4197 secs
  Fastest:  0.0016 secs
  Average:  0.0380 secs
  Requests/sec: 1314.2257
  
  Total data: 65719535 bytes
  Size/request: 833 bytes

Response time histogram:
  0.002 [1] |
  0.043 [54303] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.085 [18181] |■■■■■■■■■■■■■
  0.127 [4705]  |■■■
  0.169 [1259]  |■
  0.211 [335] |
  0.252 [85]  |
  0.294 [22]  |
  0.336 [2] |
  0.378 [1] |
  0.420 [1] |


Latency distribution:
  10% in 0.0114 secs
  25% in 0.0156 secs
  50% in 0.0280 secs
  75% in 0.0505 secs
  90% in 0.0787 secs
  95% in 0.1004 secs
  99% in 0.1511 secs

Details (average, fastest, slowest):
  DNS+dialup: 0.0000 secs, 0.0016 secs, 0.4197 secs
  DNS-lookup: 0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:  0.0000 secs, 0.0000 secs, 0.0062 secs
  resp wait:  0.0379 secs, 0.0015 secs, 0.4197 secs
  resp read:  0.0000 secs, 0.0000 secs, 0.0117 secs

Status code distribution:
  [200] 78895 responses



[ GET /node/1 1000][4]

Summary:
  Total:  60.0315 secs
  Slowest:  0.3342 secs
  Fastest:  0.0015 secs
  Average:  0.0347 secs
  Requests/sec: 1440.7264
  
  Total data: 72045337 bytes
  Size/request: 833 bytes

Response time histogram:
  0.002 [1] |
  0.035 [54888] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.068 [21902] |■■■■■■■■■■■■■■■■
  0.101 [6712]  |■■■■■
  0.135 [2085]  |■■
  0.168 [618] |
  0.201 [174] |
  0.234 [71]  |
  0.268 [26]  |
  0.301 [8] |
  0.334 [4] |


Latency distribution:
  10% in 0.0107 secs
  25% in 0.0147 secs
  50% in 0.0256 secs
  75% in 0.0458 secs
  90% in 0.0713 secs
  95% in 0.0909 secs
  99% in 0.1361 secs

Details (average, fastest, slowest):
  DNS+dialup: 0.0000 secs, 0.0015 secs, 0.3342 secs
  DNS-lookup: 0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:  0.0000 secs, 0.0000 secs, 0.0048 secs
  resp wait:  0.0346 secs, 0.0015 secs, 0.3341 secs
  resp read:  0.0000 secs, 0.0000 secs, 0.0049 secs

Status code distribution:
  [200] 86489 responses



[ GET /node/1 1000][5]

Summary:
  Total:  60.0331 secs
  Slowest:  0.3469 secs
  Fastest:  0.0015 secs
  Average:  0.0347 secs
  Requests/sec: 1440.4222
  
  Total data: 72032009 bytes
  Size/request: 833 bytes

Response time histogram:
  0.001 [1] |
  0.036 [56266] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.071 [21292] |■■■■■■■■■■■■■■■
  0.105 [6283]  |■■■■
  0.140 [1869]  |■
  0.174 [562] |
  0.209 [144] |
  0.243 [36]  |
  0.278 [15]  |
  0.312 [2] |
  0.347 [3] |


Latency distribution:
  10% in 0.0106 secs
  25% in 0.0146 secs
  50% in 0.0258 secs
  75% in 0.0457 secs
  90% in 0.0714 secs
  95% in 0.0911 secs
  99% in 0.1360 secs

Details (average, fastest, slowest):
  DNS+dialup: 0.0000 secs, 0.0015 secs, 0.3469 secs
  DNS-lookup: 0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:  0.0000 secs, 0.0000 secs, 0.0048 secs
  resp wait:  0.0346 secs, 0.0014 secs, 0.3468 secs
  resp read:  0.0000 secs, 0.0000 secs, 0.0058 secs

Status code distribution:
  [200] 86473 responses